src/Catalogs/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>Основной признак номенклатурной позиции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Признак указывает, что товар является весовым. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Comment>Способ использования характеристик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеШтрихКодов</Name>
					<Comment>Использование штрихкодов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения, подставляемая по умолчанию для номенклатурных позиций данного типа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСписаниеХарактеристик</Name>
					<Comment>Режим автоматического списания характеристик номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАвтоСписанияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДанныхХарактеристик</Name>
					<Comment>Ограничение данных характеристик</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОграниченияДанныхХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальностьСерийногоНомера</Name>
					<Comment>Уникальность серийного номера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипЭксплуатации</Name>
					<Comment>Основной тип эксплуатации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтучноВесовой</Name>
					<Comment>Признак штучно-весового товара. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЦенТолькоВРазрезеДопПараметров</Name>
					<Comment>Задает ограничение на поиск цены для данного типа номенклатуры. Если Истина - то поиск цены будет осуществляться только в разрезе доп. параметров (характеристики, единицы измерения, подразделения)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствНоменклатуры</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристик</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеЕдиницИзмерения</Name>
					<Comment>Способ использования единиц измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименованийТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Comment>Особенность учета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Продукция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПризнакиПредметаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПризнакиПредметаРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Реализуемый товар, за исключением подакцизного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Comment>Реализуемый подакцизный товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
					<Comment>Выполняемая работа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Оказываемая услуга</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаАзартнойИгры</Name>
					<Comment>Прием ставок при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышАзартнойИгры</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛотерейныйБилет</Name>
					<Comment>Прием денежных средств при реализации лотерейных билетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышЛотереи</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеРИД</Name>
					<Comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежВыплата</Name>
					<Comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскоеВознаграждение</Name>
					<Comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставнойПредметРасчета</Name>
					<Comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнойПредметРасчета</Name>
					<Comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмущественноеПраво</Name>
					<Comment>Передача имущественных прав</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнереализационныйДоход</Name>
					<Comment>Внереализационный доход</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
					<Comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
					<Comment>Сумма уплаченного торгового сбора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурортныйСбор</Name>
					<Comment>Курортный сбор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторсырье</Name>
					<Comment>Вторсырье</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОграниченияДанныхХарактеристики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОграниченияДанныхХарактеристики</Name>
			<Comment>Ограничения данных характеристики</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
					<Comment>Все данные (не ограничивать)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сроки_Сертификаты</Name>
					<Comment>Сроки хранения и сертификаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомер_Свойства</Name>
					<Comment>Серийные номера и свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свойства</Name>
					<Comment>Свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категории качества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркированнаяАП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ТипыНоменклатуры/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Типы Номенклатуры"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// предопределенный - "Штучный"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Штучный");																			// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00001");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Товар);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            1);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Весовой"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Весовой");																			// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00002");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Товар);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Истина);																			// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            1);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Размерный"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Размерный");																		// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00003");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Товар);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 1);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            3);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Серийный"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Серийный");																		// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00004");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Товар);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 2);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Услуга"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Услуга");																			// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00005");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Услуга);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Услуга);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Тара"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Тара");																			// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00006");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Тара);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            2);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            1);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Набор"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Набор");																			// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00007");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Набор);												// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            1);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Комплект"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Комплект");																		// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00008");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.Комплект);											// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 3);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            1);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Основное средство"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               НСтр("ru = 'Основное средство'"));													// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00009");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.ПрочиеАктивы);										// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 2);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Нематериальный актив"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               НСтр("ru = 'Нематериальный актив'"));												// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00010");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.ПрочиеАктивы);										// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            1);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 2);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Материалы и спецоснастка"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               НСтр("ru = 'Материалы и спецоснастка'"));											// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00011");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.ПрочиеАктивы);										// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            2);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 2);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета",                     Перечисления.ПризнакиПредметаРасчета.Товар);										// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
	// предопределенный - "Спецодежда"
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("НаименованиеТипаНоменклатуры",               "Спецодежда");																		// Имя заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("КодТипаНоменклатуры",                        "00012");																			// Код заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВидТипаНоменклатуры",                        Перечисления.ВидыНоменклатуры.ПрочиеАктивы);										// Вид заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ОсновнаяЕИТипаНоменклатуры",                 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка);	//Основная единица измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесовойТипаНоменклатуры",                    Ложь);																				// Признак весового заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеЕИТипаНоменклатуры",            2);																					// Код использования единиц измерения заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеХарактеристикТипаНоменклатуры", 2);																					// Код использования характеристик заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ИспользованиеШКТипаНоменклатуры",            0);																					// Код использования штрихкодов заполняемого типа номенклатуры
	ДанныеЗаполнения.Вставить("ВесЕИ",                                      0);																					// Вес единицы измерения
	ДанныеЗаполнения.Вставить("ТочностьЕИ",                                 0);																					// Точность единицы измерения
	ДанныеЗаполнения.Вставить("ПризнакПредметаРасчета", Перечисления.ПризнакиПредметаРасчета.Товар);															// ПризнакПредметаРасчета
	ЗаполнитьЭлемент(ДанныеЗаполнения);
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Процедура заполнения элемента справочника
//
// Параметры:
// ДанныеЗаполнения - Структура - данные заполнения, имеющие следующую структуру:
// 	* ЗаполнятьВсе 					- Булево - Признак заполнения всех реквизитов элемента справочника
// 	* НаименованиеТипаНоменклатуры 	- Строка - Имя заполняемого типа номенклатуры
// 	* КодТипаНоменклатуры 				- Строка - Код заполняемого типа номенклатуры
// 	* ВидТипаНоменклатуры 				- ПеречислениеСсылка	- Вид заполняемого типа номенклатуры
// 	* ОсновнаяЕИТипаНоменклатуры 		- СправочникСсылка 	- Основная единица измерения заполняемого типа номенклатуры
//  * ВесовойТипаНоменклатуры 			- Булево - Признак весового заполняемого типа номенклатуры
// 	* ИспользованиеЕИТипаНоменклатуры 	- Число  - Код использования единиц измерения заполняемого типа номенклатуры
// 	* ИспользованиеХарактеристикТипаНоменклатуры	- Число - Код использования характеристик 
//																заполняемого типа номенклатуры
// 	* ИспользованиеШКТипаНоменклатуры 	- Число - Код использования штрихкодов заполняемого типа номенклатуры
// 	* ВесЕИ 							- Число 	- Вес единицы измерения
// 	* ТочностьЕИ 						- Число 	- Точность единицы измерения
// 	* ПризнакПредметаРасчета       	- ПеречислениеСсылка	- Признак предмета расчета заполняемого типа номенклатуры.
//
Процедура ЗаполнитьЭлемент(ДанныеЗаполнения)
	
	ТипНоменклатуры = Справочники.ТипыНоменклатуры.НайтиПоНаименованию(ДанныеЗаполнения.НаименованиеТипаНоменклатуры,Истина);
	Если ТипНоменклатуры.Пустая() Тогда
		ТипНоменклатуры = Справочники.ТипыНоменклатуры.СоздатьЭлемент();
	Иначе
		ТипНоменклатуры = ТипНоменклатуры.ПолучитьОбъект();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.Код) Тогда
		ТипНоменклатуры.Код = ДанныеЗаполнения.КодТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.Наименование) Тогда
		ТипНоменклатуры.Наименование = ДанныеЗаполнения.НаименованиеТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ВидНоменклатуры) Тогда
		ТипНоменклатуры.ВидНоменклатуры = ДанныеЗаполнения.ВидТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
		ТипНоменклатуры.БазоваяЕдиницаИзмерения = ДанныеЗаполнения.ОсновнаяЕИТипаНоменклатуры;
	КонецЕсли;
	Если ТипНоменклатуры.Весовой <> ДанныеЗаполнения.ВесовойТипаНоменклатуры Тогда
		ТипНоменклатуры.Весовой = ДанныеЗаполнения.ВесовойТипаНоменклатуры;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ИспользованиеЕдиницИзмерения) Тогда
		ТипНоменклатуры.ИспользованиеЕдиницИзмерения = ДанныеЗаполнения.ИспользованиеЕИТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ИспользованиеХарактеристик) Тогда
		ТипНоменклатуры.ИспользованиеХарактеристик = ДанныеЗаполнения.ИспользованиеХарактеристикТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ИспользованиеШтрихКодов) Тогда
		ТипНоменклатуры.ИспользованиеШтрихКодов = ДанныеЗаполнения.ИспользованиеШКТипаНоменклатуры;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ПризнакПредметаРасчета) Тогда
		ТипНоменклатуры.ПризнакПредметаРасчета = ДанныеЗаполнения.ПризнакПредметаРасчета;
	КонецЕсли;

	// сохранение элемента
	НовыйЭлемент = ТипНоменклатуры.ЭтоНовый();
	Если ТипНоменклатуры.Модифицированность() Тогда
		Попытка
			ТипНоменклатуры.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы номенклатуры"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипНоменклатуры.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Типы номенклатуры""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(ТипНоменклатуры.Наименование), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Если ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 И (НЕ ЗначениеЗаполнено(ТипНоменклатуры.БазоваяЕдиницаИзмерения)) Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ТипНоменклатуры.БазоваяЕдиницаИзмерения.Наименование,Истина,,ТипНоменклатуры.Ссылка);
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			ЕдиницаИзмерения.Владелец = ТипНоменклатуры.Ссылка;
			ЕдиницаИзмерения.УстановитьНовыйКод("");
			ЕдиницаИзмерения.Наименование = ТипНоменклатуры.БазоваяЕдиницаИзмерения.Наименование;
			ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ТипНоменклатуры.БазоваяЕдиницаИзмерения;
			ЕдиницаИзмерения.Коэффициент = 1;
			ЕдиницаИзмерения.Вес = ДанныеЗаполнения.ВесЕИ;
			ЕдиницаИзмерения.Точность = ДанныеЗаполнения.ТочностьЕИ;
			Попытка
				ЕдиницаИзмерения.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Типы номенклатуры"" элемент ""%1"" добавлена единица измерения ""%2""'"),,,,, СокрЛП(ТипНоменклатуры.Наименование), ЕдиницаИзмерения.Наименование);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Единицы измерения""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(ЕдиницаИзмерения.Наименование), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// Заполним реквизит у не предопределенных элементов
	ЗаполнитьНовыеРеквизиты();
	
КонецПроцедуры // ЗаполнитьЭлемент()

//тк+
Функция  ПолучитьТаблицуЭлементовШаблона(ШаблонДляРазбора) Экспорт
	
	ВременныйШаблон = ШаблонДляРазбора;
	ТаблицаПолейШаблона = Новый ТаблицаЗначений;
	ТаблицаПолейШаблона.Колонки.Добавить("Описание");
	ТаблицаПолейШаблона.Колонки.Добавить("Префикс");
	ТаблицаПолейШаблона.Колонки.Добавить("Значение");
	ТаблицаПолейШаблона.Колонки.Добавить("Заглавными");
	ТаблицаПолейШаблона.Колонки.Добавить("Расшифровка");
	ТаблицаПолейШаблона.Колонки.Добавить("Подпись");
	
	ЭлементыШаблона = СтрЗаменить(ШаблонДляРазбора, " #", Символы.ПС + "#");
	
	Для Сч=1 По СтрЧислоСтрок(ЭлементыШаблона) Цикл
		ЭлементШаблона = СокрЛП(СтрПолучитьСтроку(ЭлементыШаблона, Сч));
		Если ПустаяСтрока(ЭлементШаблона) Тогда
			Продолжить;
		КонецЕсли;
		ДеталиЭлементов = СтрЗаменить(ЭлементШаблона, "<", Символы.ПС);
		ДеталиЭлементов = СтрЗаменить(ДеталиЭлементов, ">", Символы.ПС);
				
		Префикс = СокрЛП(СтрПолучитьСтроку(ДеталиЭлементов, 1));
		Если ПустаяСтрока(Префикс) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаПолейШаблона.Добавить();
		СтрокаТаблицы.Префикс = Префикс;
		
		Если ВРег(Префикс) = Префикс Тогда 
			СтрокаТаблицы.Заглавными = Истина;
		КонецЕсли;
		
		Если ВРег(Префикс)		= "#ТК#" Тогда
			СтрокаТаблицы.Расшифровка = "Товарная категория";
		ИначеЕсли ВРег(Префикс) = "#ТМ#" Тогда
			СтрокаТаблицы.Расшифровка = "Товарная марка";
		ИначеЕсли ВРег(Префикс) = "#ЗА#" Тогда
			СтрокаТаблицы.Расшифровка = "Значение ассортимента";
		ИначеЕсли ВРег(Префикс) = "#УМ#" Тогда
			СтрокаТаблицы.Расшифровка = "Уточнение товарной марки";
		ИначеЕсли ВРег(Префикс) = "#СП#" Тогда
			СтрокаТаблицы.Расшифровка = "Страна происхождения";	
		ИначеЕсли ВРег(Префикс) = "#ПР#" Тогда
			СтрокаТаблицы.Расшифровка = "Производитель";	
		ИначеЕсли ВРег(Префикс) = "#ПТ#" Тогда
			СтрокаТаблицы.Расшифровка = "Произвольный текст";
		ИначеЕсли ВРег(Префикс) = "#ДР#" Тогда
			СтрокаТаблицы.Расшифровка = "Дополнительный реквизит товара";
		ИначеЕсли ВРег(Префикс) = "#ДС#" Тогда
			СтрокаТаблицы.Расшифровка = "Дополнительное сведение товара";
		ИначеЕсли ВРег(Префикс) = "#*ДР#" Тогда
			СтрокаТаблицы.Расшифровка = "Все дополнительные реквизиты товара";	
		КонецЕсли;
				
		Значение = СокрЛП(СтрПолучитьСтроку(ДеталиЭлементов, 2));
		Подпись = СокрЛП(СтрПолучитьСтроку(ДеталиЭлементов, 3));
		
		Если Не ПустаяСтрока(Значение) Тогда
			//Значение = СтрЗаменить(Значение, ">", "");
			СтрокаТаблицы.Значение = Значение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(Подпись) Тогда
			//Значение = СтрЗаменить(Значение, ">", "");
			СтрокаТаблицы.Подпись = Подпись;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПолейШаблона;
	
КонецФункции
// тк-

Процедура ЗаполнитьНовыеРеквизиты()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры
	               |ГДЕ
	               |	ТипыНоменклатуры.Предопределенный = ЛОЖЬ
	               |	И ТипыНоменклатуры.ЭтоГруппа = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТипНоменклатуры = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.ПризнакПредметаРасчета) Тогда
			ТипНоменклатуры.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		КонецЕсли;
	
		// сохранение элемента
		Если ТипНоменклатуры.Модифицированность() Тогда
			Попытка
				ТипНоменклатуры.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Типы номенклатуры"". ""%1"" элемент ""%2""'"),,,,, "Обновлен", СокрЛП(ТипНоменклатуры.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Типы номенклатуры""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(ТипНоменклатуры.Наименование), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьНовыеРеквизиты()

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ВидНоменклатуры");
		ОбязательныеРеквизиты.Добавить("ИспользованиеЕдиницИзмерения");
		ОбязательныеРеквизиты.Добавить("ПризнакПредметаРасчета");
		ОбязательныеРеквизиты.Добавить("ИспользованиеХарактеристик");
		Если Объект.ИспользованиеЕдиницИзмерения = 1
			И Объект.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.ПрочиеАктивы Тогда
			ОбязательныеРеквизиты.Добавить("БазоваяЕдиницаИзмерения");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ИспользованиеЕдиницИзмерения");
	Результат.Добавить("ИспользованиеХарактеристик");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Основная базовая единица измерения".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура БазоваяЕдиницаИзмеренияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияМассы Тогда
		Объект.Весовой = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры // БазоваяЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Использование характеристик".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ИспользованиеХарактеристикПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если (Объект.ИспользованиеХарактеристик = 3) Тогда
		Объект.ИспользованиеШтрихКодов = ?(Объект.ИспользованиеШтрихКодов = 2,0,Объект.ИспользованиеШтрихКодов);
	КонецЕсли;
	
КонецПроцедуры // ИспользованиеХарактеристикПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Уникальность серийного номера".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура УникальностьСерийногоНомераПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если (НЕ Объект.ЭтоГруппа) И Объект.УникальностьСерийногоНомера Тогда // Проверим не нужно ли снять флажок уникальности серийного номера
		Если (Объект.ИспользованиеХарактеристик<>2)
			ИЛИ ((Объект.ОграничениеДанныхХарактеристик<>Перечисления.ОграниченияДанныхХарактеристики.Все)
				И(Объект.ОграничениеДанныхХарактеристик<>Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства)) Тогда
			Объект.УникальностьСерийногоНомера = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УникальностьСерийногоНомераПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вид номенклатуры".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВидНоменклатурыПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Если вид номенклатуры "Прочие активы", то очищаем реквизит "Основная базовая единица измерения".
	Если Объект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ПрочиеАктивы Тогда
		Объект.БазоваяЕдиницаИзмерения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ВидНоменклатурыПриИзменении()

//тк+
// Обработчик события возникающего при изменении данных реквизита "Весовой".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВесовойПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Обновляем отображение элементов формы
	Если Объект.Весовой И Объект.ШтучноВесовой Тогда
		Объект.ШтучноВесовой = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВесовойПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "ШтучноВесовой".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ШтучноВесовойПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Обновляем отображение элементов формы
	Если Объект.ШтучноВесовой И Объект.Весовой Тогда
		Объект.Весовой = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ШтучноВесовойПриИзмененииНаСервере()
//тк-

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
